{
    "train_params": {
        "epochs": 20
    },
    "dataset_params": {
        "class_name": "H5Reader",
        "config": {
            "filename": "C:/Users/Windows User/Documents/UNI/M30-DV/HNC dataset/outcome_ous.h5",
            "batch_size": 2,
            "x_name": "image",
            "y_name": "OS_surv",
            "batch_cache": 4,
            "shuffle": true,
            "train_folds": [
                0
            ],
            "val_folds": [
                3
            ],
            "test_folds": [
                4
            ],
            "preprocessors": [
                {
                    "class_name": "CropImage",
                    "config": {
                        "size": [64, 64, 64]
                    }
                },
                {
                    "class_name": "ChannelRemoval",
                    "config": {
                        "channel": [2, 3]
                    }
                },
                {
                    "class_name": "HounsfieldWindowingPreprocessor",
                    "config": {
                        "window_center": 70,
                        "window_width": 200,
                        "channel": 0
                    }
                },
                {
                    "class_name": "ImageNormalizerPreprocessor",
                    "config": {
                        "vmin": [
                            -100,
                            0
                        ],
                        "vmax": [
                            100,
                            25
                        ]
                    }
                },
                {
                    "class_name": "MakeSurvArray",
                    "config": {
                        "breaks": [0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 60]
                    }
                }
            ],
            "augmentations": []
        }
    },
    "input_params": {
        "shape": [
            64,
            64,
            64,
            2
        ]
    },
    "model_params": {
        "loss": {
            "class_name": "NegativeLogLikelihood",
            "config":{
                "n_intervals": 10
            }
        },
        "optimizer": {
            "class_name": "adam",
            "config": {
                "learning_rate": 0.0001
            }
        },
        "metrics": [
        ]
    },
    "architecture": {
        "type": "Generic",
        "layers": [
            {
                "name": "stem_conv",
                "class_name": "Conv3D",
                "config": {
                    "filters": 16,
                    "kernel_size": 3,
                    "strides": 2,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_out",
                            "distribution": "truncated_normal"
                        }
                    },
                    "padding": "same",
                    "use_bias": false
                }
            },
            {
                "name": "stem_bn",
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 4,
                    "momentum": 0.9
                }
            },
            {
                "name": "stem_activation",
                "class_name": "Activation",
                "config": {
                    "activation": "swish"
                }
            },
            {
                "name": "avg_pool",
                "class_name": "GlobalAveragePooling3D"
            },
            {
                "name": "top_dropout",
                "class_name": "Dropout",
                "config": {
                    "rate": 0.2
                }
            },
            {
                "name": "predictions",
                "class_name": "Dense",
                "config": {
                    "units": 10,
                    "activation": "sigmoid",
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 0.3333333333333333,
                            "mode": "fan_out",
                            "distribution": "uniform"
                        }
                    },
                    "bias_initializer": "Constant"
                }
            }
        ]
    }
}
